<?php

return array(
    'current_version' => '5.0',

    'changelogs' => array(
        '5.0' => [
            'date' => '1403/04/25',
            'changes' => [
                '🔥 اضافه شدن بخش قالب ها (صفحه ساز): از این پس میتوانید برای صفحه اصلی سایت قالب های متعددی طراحی کنید و از بخش تنظیمات > ظاهر سایت، قالب مورد نظر را برای صفحه اصلی انتخاب کنید.',
                'حذف شدن تنظیمات مربوط به استایل بخش های صفحه اصلی از بخش تنظیمات ظاهر سایت. به جای آن از بخش قالب ها استفاده میشود.',
                'حذف شدن بخش محتوای سئوی صفحه اصلی و سوالات متداول از بخش تنظیمات عمومی، به جای آن از ویجت های ویرایشگر متن و سوالات متداول در طراحی قالب استفاده کنید.',
                'رفع برخی باگ های جزئی',
            ]
        ],
        '4.2' => [
            'date' => '1403/03/14',
            'changes' => [
                'رفع مشکل اعمال نشدن کد تخفیف روی سبد خرید',
                'رفع مشکل در ثبت آدرس',
                'رفع مشکلات جزئی در ظاهر سایت',
                'رفع مشکل بازگشت از درگاه پرداخت در بعضی مواقع',
                'رفع مشکل محاسبه هزینه ارسال در بعضی شرایط خاص',
                'رفع شدن مشکل schema که موجود رخ دادن اخطار در سرچ کنسول شده بود',
                'جایگزین شدن ویرایشگر متن با قابلیت های جدید و امکان درج ویدیو',
                'لغو خودکار سفارش های پرداخت نشده بعد از یک ساعت و اضافه شدن موجودی محصولات',
                'اضافه شدن امکان درج کد جاوااسکریپت سفارشی به هدر سایت',
                'بروزرسانی لوگوی درگاه پرداخت زرین پال',
                'اضافه شدن امکان ارسال مجدد کدیکبار مصرف هنگام ورود مشتریان',
                'اضافه شدن امکان ارسال ایمیل تست در تنظیمات کانفیگ',
                '🔥 اضافه شدن نوار مدیریت سایت',
                'رفع تمامی باگ های جزئی گزارش شده توسط کاربران',
            ]
        ],
        '4.1' => [
            'date' => '1403/01/8',
            'changes' => [
                'اضافه شدن قابلیت درج داستان (استوری)',
                'اضافه شدن درگاه بانکی پاسارگاد (تست نشده)، برای فعالسازی تیکت بزنید',
                'رفع مشکل فیلتر محصولات ناموجود، انتقال محصولات ناموجود به انتهای لیست بصورت پیشفرض',
                'رفع مشکل عدم نمایش فرم درج کد تخفیف هنگام خرید',
                'نمایش روش ارسال در برچسب ارسال پستی',
                'بهبود ظاهر و خوانایی لیست سفارشات',
                'اضافه شدن وضعیت سفارش (تحویل به پست)',
                ' تغییر اتوماتیک وضعیت سفارش به (تکمیل شده) هنگام درج کدرهگیری',
                'ارسال پیامک برای مشتری هنگام درج کدرهگیری سفارش',
                'رفع مشکل ویرایش محصولات متغییر',
                'اضافه شدن روش ارسال تیپاکس (پس کرایه) به تنظیمات حمل و نقل',
                'رفع مشکل افزایش حجم تصاویر محصول هنگام آپلود',
                'رفع مشکل یکسان نبودن ارتفاع کارد محصولات',
                'بهبود رابط کاربری',
            ]
        ],
        '4.0' => [
            'date' => '1402/11/25',
            'changes' => [
                'اضافه شدن قابلیت فیلتر بر اساس ویژگی های محصول: از مسیر محصولات > ویژگی ها > ویرایش، میتوانید گزینه فیلترشدنی را برای ویژگی مورد نظر فعال کنید تا در صفحه آرشیو محصولات نمایش داده شود.',
                'اضافه شدن مجوز دسترسی به تیکت ها در لیست مجوزهای هر نقش',
                'اضافه شدن قابلیت گروه بندی ویژگی ها: از مسیر محصولات > ویژگی ها > گروه های ویژگی، میتوانید گروه های مختلفی از ویژگی با مقادیر پیشفرض ایجاد کرده و هنگام درج محصولات از بخش ویژگی ها کلی، گروه ویژگی مورد نظر را برای محصول انتخاب کنید.',
                'اضافه شدن امکان سفارشی سازی گزینه های حمل و نقل: از مسیر تنظیمات > حمل و نقل، میتوانید روش های حمل و نقل و هزینه های هر کدام را ویرایش کنید.',
                'اضافه شدن امکان تعیین شهر های تحت پوشش پیک موتوری و هزینه به ازای هر کیلوگرم وزن اضافی محصول',
                'اضافه شدن امکان تعیین زمان ارسال برای محصول',
                'اضافه شدن امکان وارد کردن هزینه های حمل و نقل اضافی برای هر محصول',
                'اضافه شدن امکان تغییر فونت سایت: اضافه شدن 4 فونت فارسی حرفه ای: میتوانید از مسیر تنظیمات > تنظیمات ظاهری > استایل کلی > فونت سایت را ویرایش کنید.',
                'اضافه شدن فیلد اولویت نمایش دسته بندی های ویژه در صفحه اصلی: از مسیر محصولات > دسته بندی ها > ویرایش، با فعالسازی تیک دسته ویژه میتوانید اولویت نمایش را نیز مشخص کنید.',
                'اضافه شدن امکان جستجوی سفارشات بر اساس نام و موبایل مشتری',
                'اضافه شدن امکان ارسال فایل در تیکت ها',
                'اضافه شدن امکان غیرفعال کردن فاکتور برای مشتری در پروفایل کاربری از طریق تنظیمات فاکتور فروش',
                'اضافه شدن صفحه changelog در پنل مدیریت',
                'اضافه شدن امکان مخفی کردن تصویر مقاله در صفحه تکی',
                'نمایش تعداد موجودی در لیست محصولات پنل مدیریت',
                'بهینه کردن اجرای صف ها جهت صرفه جویی در منابع سرور',
                'رفع تمامی مشکلات گزارش شده'
            ]
        ],
    ),
);
